In [2]:
import networkx as nx
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import json
%matplotlib inline

In [3]:
#Loading in of Datasets
load_set1=open("18391933-dataset1.json",)
set1_data=json.load(load_set1)
load_set1.close()

load_set2=open("18391933-dataset2.json",)
set2_data=json.load(load_set2)
load_set2.close()

In [4]:
set1_df=pd.DataFrame(set1_data)
set2_df=pd.DataFrame(set2_data)

set1_df.head()

,id,name,born,movies
0,000128,Russell Crowe,1964-04-07,"[{'id': '10059518', 'title': 'Unhinged', 'year..."
1,0206257,Rosario Dawson,1979-05-09,"[{'id': '13787320', 'title': 'Rocky Horror Sho..."
2,000905,Roberto Benigni,1952-10-27,"[{'id': '8333746', 'title': 'Pinocchio', 'year..."
3,0001833,Emily Watson,1967-01-14,"[{'id': '10482370', 'title': 'The Third Day', ..."
4,5052065,Ansel Elgort,1994-03-14,"[{'id': '3864056', 'title': 'The Goldfinch', '..."

In [5]:
set2_df.head()

,id,name,born,movies
0,0000538,Colm Meaney,1953-05-30,"[{'id': '13356010', 'title': 'The Monkey', 'ye..."
1,0914455,Leonor Watling,1975-07-28,"[{'id': '10039610', 'title': 'Mi hermano Juan'..."
2,0000932,Halle Berry,1966-08-14,"[{'id': '8310474', 'title': 'Bruised', 'year':..."
3,0000138,Leonardo DiCaprio,1974-11-11,"[{'id': '8690814', 'title': 'Grant', 'year': 2..."
4,0591485,Liza Minnelli,1946-03-12,"[{'id': '10908058', 'title': 'The King of Come..."

In [6]:
#df=pd.concat([set1_df,set2_df])
#df=df.reset_index(drop=True)
#df

In [7]:
def clean(df):
    del df["id"]
    del df["born"]
    
    
clean(set1_df)
clean(set2_df)

In [8]:
set1_df.head()

              name                                             movies
0    Russell Crowe  [{'id': '10059518', 'title': 'Unhinged', 'year...
1   Rosario Dawson  [{'id': '13787320', 'title': 'Rocky Horror Sho...
2  Roberto Benigni  [{'id': '8333746', 'title': 'Pinocchio', 'year...
3     Emily Watson  [{'id': '10482370', 'title': 'The Third Day', ...
4     Ansel Elgort  [{'id': '3864056', 'title': 'The Goldfinch', '...

In [9]:
#adding actors to list of nodes
actors1=set1_df["name"]
actors2=set2_df["name"]

In [10]:
by_actor1={}
i=0
for actor in actors1:
    films=[]
    star=set1_df["movies"][i]
    limit=len(star)
    
    for j in range (0,limit):
        temp=set1_df["movies"][i][j]["title"]
        films.append(temp)
    
    by_actor1[actor]=films
    i=i+1
    
 #######################################################################################   
by_actor2={}
i=0
for actor in actors2:
    films=[]
    star=set2_df["movies"][i]
    limit=len(star)
    
    for j in range (0,limit):
        temp=set2_df["movies"][i][j]["title"]
        films.append(temp)
    
    by_actor2[actor]=films
    i=i+1

In [46]:
g1=nx.Graph()

## Use loops and the intersection function to find those that intersect
for actor in actors1:
    g1.add_node(actor)
    
for i in range (len(actors1)-1):
    list1=by_actor1[actors1[i]]
    for j in range(i+1,len(actors1)):
        list1_asSet=set(list1)
        list2=by_actor1[actors1[j]]
        intersection=list(list1_asSet.intersection(list2))
        
        if intersection:
            g1.add_edge(actors1[i],actors1[j], weight=len(intersection))
            
            
##########################################################################################

g2=nx.Graph()
for actor in actors2:
    g2.add_node(actor)
    
for i in range (len(actors2)-1):
    list1=by_actor2[actors2[i]]
    for j in range(i+1,len(actors2)):
        list1_asSet=set(list1)
        list2=by_actor2[actors2[j]]
        intersection=list(list1_asSet.intersection(list2))
        
        if intersection:
            g2.add_edge(actors2[i],actors2[j], weight=len(intersection))

In [61]:
def showEdges(graph):
    for edge in graph.edges(data=True):
        print(edge)

def showNodes(graph):
    for node in graph.node(data=True):
        print(node)
    
def drawGraph(graph):
    nx.draw(g1,with_labels=True,node_color='cyan', font_color='black', font_size=9)

def networkSizes(graph):
    print("Number of nodes:",graph.number_of_nodes())
    print("Number of edges:",graph.number_of_edges())